spec/cassettes/StripeWrapper/StripeWrapper_Charge/_create/makes_a_successful_charge.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=4&card[exp_year]=2019&card[cvc]=314
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.11.0
      Authorization:
      - Bearer sk_test_0FpmDmQi1YnBQuNKiWUH4Qm5
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - "{\"bindings_version\":\"1.11.0\",\"lang\":\"ruby\",\"lang_version\":\"2.1.0
        p0 (2013-12-25)\",\"platform\":\"x86_64-linux\",\"publisher\":\"stripe\",\"uname\":\"Linux
        zac-mint 3.11.0-12-generic #19-Ubuntu SMP Wed Oct 9 16:20:46 UTC 2013 x86_64
        x86_64 x86_64 GNU/Linux\"}"
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 16 Apr 2014 17:48:30 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '570'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_103rgW20rukLV0WoarZ0xRdb",
          "livemode": false,
          "created": 1397670510,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_103rgW20rukLV0WoyOaC3Ubz",
            "object": "card",
            "last4": "4242",
            "type": "Visa",
            "exp_month": 4,
            "exp_year": 2019,
            "fingerprint": "YDswDJ57KdtFpKMt",
            "customer": null,
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null
          }
        }
    http_version: 
  recorded_at: Wed, 16 Apr 2014 17:48:30 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=400&currency=usd&card=tok_103rgW20rukLV0WoarZ0xRdb&description=Valid%20Charge
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.11.0
      Authorization:
      - Bearer sk_test_0FpmDmQi1YnBQuNKiWUH4Qm5
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - "{\"bindings_version\":\"1.11.0\",\"lang\":\"ruby\",\"lang_version\":\"2.1.0
        p0 (2013-12-25)\",\"platform\":\"x86_64-linux\",\"publisher\":\"stripe\",\"uname\":\"Linux
        zac-mint 3.11.0-12-generic #19-Ubuntu SMP Wed Oct 9 16:20:46 UTC 2013 x86_64
        x86_64 x86_64 GNU/Linux\"}"
      Content-Length:
      - '84'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 16 Apr 2014 17:48:31 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1010'
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Cache-Control:
      - no-cache, no-store
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_103rgW20rukLV0WoxJIIBQIm",
          "object": "charge",
          "created": 1397670511,
          "livemode": false,
          "paid": true,
          "amount": 400,
          "currency": "usd",
          "refunded": false,
          "card": {
            "id": "card_103rgW20rukLV0WoyOaC3Ubz",
            "object": "card",
            "last4": "4242",
            "type": "Visa",
            "exp_month": 4,
            "exp_year": 2019,
            "fingerprint": "YDswDJ57KdtFpKMt",
            "customer": null,
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "pass",
            "address_line1_check": null,
            "address_zip_check": null
          },
          "captured": true,
          "refunds": [],
          "balance_transaction": "txn_103rgW20rukLV0WoeVgNNq6M",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 0,
          "customer": null,
          "invoice": null,
          "description": "Valid Charge",
          "dispute": null,
          "metadata": {},
          "statement_description": null
        }
    http_version: 
  recorded_at: Wed, 16 Apr 2014 17:48:31 GMT
recorded_with: VCR 2.9.0
